CAnimationVariableChangeHandler.CreateInstance(CAnimationController*,IUIAnimationVariableChangeHandler**)
Creates an instance of CAnimationVariableChangeHandler object.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pAnimationController: A pointer to animation controller, which will receive events.
ppManagerEventHandler: Output. If the method succeeds it contains a pointer to COM object that will handle
variable change events.